## DataFrame
A dataframe is a two-dimensional labelled Data structure.<br>
It contains rows and column ,therefore has both row & columns index.<br>

# Creation of DataFrame

In [1]:
# Empty DataFrame

In [2]:
import pandas as pd
import numpy as np

In [3]:
df_empty = pd.DataFrame()

In [4]:
print(df_empty)

Empty DataFrame
Columns: []
Index: []

### Creation of Data frame from Numpy array

In [5]:
arr1 = np.array([10,20,30])
arr2 = np.array([11,22,33])
arr3 = np.array([40,50,60])
df = pd.DataFrame(arr1)
df

    0
0  10
1  20
2  30

In [6]:
df = pd.DataFrame([arr1,arr2,arr3])
df

    0   1   2
0  10  20  30
1  11  22  33
2  40  50  60

In [7]:
columns = ['A','B','C']

In [8]:
df = pd.DataFrame([arr1,arr2,arr3],columns =columns )
df

    A   B   C
0  10  20  30
1  11  22  33
2  40  50  60

## Creatiing of DataFrame using List of Dictionary

In [9]:
list_dict = [
    {"id" : 101,"name" : "Orange","price" : 120,"city" : "meerut"},
     {"id" : 102,"name" : "Apple","price" : 150,"city" : "kanpur"},
     {"id" : 103,"name" : "Mango","price" : 160,"city" : "mumbai"},
     {"id" : 104,"name" : "Banana","price" : 180,"city" : "goa","cnt" : 100},
]
data = pd.DataFrame(list_dict)

In [10]:
data
# Here dictionary Keys are taken as columns label, and valus as row

    id    name  price    city    cnt
0  101  Orange    120  meerut    NaN
1  102   Apple    150  kanpur    NaN
2  103   Mango    160  mumbai    NaN
3  104  Banana    180     goa  100.0

## Creatiing of DataFrame using Dictionary  of List

In [11]:
# Array Always must be the same length
dict_list = {"id" : [101,102,103,104],
            "name" : ["Orange","Apple","Mango","Banana"],
             "price" : [120,150,160,180],
             "city" : ["meerut","kanpur","mumbai","goa"],
             "cnt" : [None,None,None,10]
            }
data = pd.DataFrame(dict_list)
data

    id    name  price    city   cnt
0  101  Orange    120  meerut   NaN
1  102   Apple    150  kanpur   NaN
2  103   Mango    160  mumbai   NaN
3  104  Banana    180     goa  10.0

In [12]:
data1 = pd.DataFrame(dict_list,columns = ['cnt','city','name','id']) # Chnage Sequence
data1

    cnt    city    name   id
0   NaN  meerut  Orange  101
1   NaN  kanpur   Apple  102
2   NaN  mumbai   Mango  103
3  10.0     goa  Banana  104

# Creating Pandas using Series

In [14]:
s1 = pd.Series([10,20,30])
s2 = pd.Series(["apple","mango","orange"])
s3 = pd.Series([150,130,160])
data = pd.DataFrame([s1,s2,s3])
data

       0      1       2
0     10     20      30
1  apple  mango  orange
2    150    130     160

In [15]:
s1 = pd.Series([10,20,30])
s2 = pd.Series(["apple","mango","orange"])
s3 = pd.Series([150,130,160])
data = pd.DataFrame({"id":s1,"name":s2,"price":s3})
data

   id    name  price
0  10   apple    150
1  20   mango    130
2  30  orange    160

### =================End ==============================

# Operation on Rows and columns

In [16]:
list_dict = [
    {"id" : 101,"name" : "Orange","price" : 120,"city" : "meerut"},
     {"id" : 102,"name" : "Apple","price" : 150,"city" : "Jhansi"},
     {"id" : 103,"name" : "Mango","price" : 160,"city" : "mumbai"},
     {"id" : 104,"name" : "Banana","price" : 180,"city" : "calicut"},
]
data = pd.DataFrame(list_dict)
data

    id    name  price     city
0  101  Orange    120   meerut
1  102   Apple    150   Jhansi
2  103   Mango    160   mumbai
3  104  Banana    180  calicut

## Adding New Column to DataFrame

In [17]:

data['state'] = ["Uttar Pradesh","Madhya Pradesh","Maharashtra","Kerala",]
data

    id    name  price     city           state
0  101  Orange    120   meerut   Uttar Pradesh
1  102   Apple    150   Jhansi  Madhya Pradesh
2  103   Mango    160   mumbai     Maharashtra
3  104  Banana    180  calicut          Kerala

In [18]:
data['country'] = "india"
data

    id    name  price     city           state country
0  101  Orange    120   meerut   Uttar Pradesh   india
1  102   Apple    150   Jhansi  Madhya Pradesh   india
2  103   Mango    160   mumbai     Maharashtra   india
3  104  Banana    180  calicut          Kerala   india

# Adding New Rows to dataFrame

In [19]:
data.loc[10] = [105,"pineapple",190,"Ghaziabad","uttar pradesh","India"]

In [20]:
# data.loc[0] = 10

In [21]:
data

     id       name  price       city           state country
0   101     Orange    120     meerut   Uttar Pradesh   india
1   102      Apple    150     Jhansi  Madhya Pradesh   india
2   103      Mango    160     mumbai     Maharashtra   india
3   104     Banana    180    calicut          Kerala   india
10  105  pineapple    190  Ghaziabad   uttar pradesh   India

In [22]:
data.loc[1:3] = 99 # opetional
data

     id       name  price       city          state country
0   101     Orange    120     meerut  Uttar Pradesh   india
1    99         99     99         99             99      99
2    99         99     99         99             99      99
3    99         99     99         99             99      99
10  105  pineapple    190  Ghaziabad  uttar pradesh   India

## Deleting Rows and Columns from DataFrame
We can use DataFrame.drop() method to delete rows and columns from DataFrame.<br>
We need to specify the name of labels to be dropped and axis from which they need to be dropped<br>
To delete a row, parameter axis assigned to value 0,<br>
To delete a columns ,parameter axis assigned to value 1

In [23]:
list_dict = [
    {"id" : 101,"name" : "Orange","price" : 120,"city" : "meerut"},
     {"id" : 102,"name" : "Apple","price" : 150,"city" : "Jhansi"},
     {"id" : 103,"name" : "Mango","price" : 160,"city" : "mumbai"},
     {"id" : 104,"name" : "Banana","price" : 180,"city" : "calicut"},
]
main_data = pd.DataFrame(list_dict)
main_data.loc[4] = [105,"pineapple",190,"Ghaziabad"]
data = main_data

In [24]:
data

    id       name  price       city
0  101     Orange    120     meerut
1  102      Apple    150     Jhansi
2  103      Mango    160     mumbai
3  104     Banana    180    calicut
4  105  pineapple    190  Ghaziabad

In [25]:
data = data.drop(2, axis = 0)
data

    id       name  price       city
0  101     Orange    120     meerut
1  102      Apple    150     Jhansi
3  104     Banana    180    calicut
4  105  pineapple    190  Ghaziabad

In [26]:
data = main_data
data

    id       name  price       city
0  101     Orange    120     meerut
1  102      Apple    150     Jhansi
2  103      Mango    160     mumbai
3  104     Banana    180    calicut
4  105  pineapple    190  Ghaziabad

In [27]:
data = data.drop([1,3])
data

    id       name  price       city
0  101     Orange    120     meerut
2  103      Mango    160     mumbai
4  105  pineapple    190  Ghaziabad

In [28]:
# Renaming Row and columns label

In [29]:
data = main_data
data

    id       name  price       city
0  101     Orange    120     meerut
1  102      Apple    150     Jhansi
2  103      Mango    160     mumbai
3  104     Banana    180    calicut
4  105  pineapple    190  Ghaziabad

In [30]:
# Renaming row label
data = data.rename({0:'a',1:'b'},axis = "index")
data

    id       name  price       city
a  101     Orange    120     meerut
b  102      Apple    150     Jhansi
2  103      Mango    160     mumbai
3  104     Banana    180    calicut
4  105  pineapple    190  Ghaziabad

In [31]:
# Renaming columsn
data = data.rename({"id":"user_id","name" :"full_name"},axis = "columns")
data

   user_id  full_name  price       city
a      101     Orange    120     meerut
b      102      Apple    150     Jhansi
2      103      Mango    160     mumbai
3      104     Banana    180    calicut
4      105  pineapple    190  Ghaziabad

## Accessing DataFrame Element through Indexing
Data element in a DataFrame can be accessed using indexing. There are two ways of indexing DataFrame<br>
**Label based indexing & Boolean Indexing**

## (A) Label Based Indexing
There are several ways in pandas to implement label based indexing. <br>
**DataFrame.loc[]** is an important method that is used for label based indexing with Dataframe.

In [48]:
data = main_data
data.head()

    id       name  price       city
0  101     Orange    120     meerut
1  102      Apple    150     Jhansi
2  103      Mango    160     mumbai
3  104     Banana    180    calicut
4  105  pineapple    190  Ghaziabad

In [49]:
data.loc[3] #
# data = data.rename({0:'a',1:'b'},axis = "index")
#data.loc['a']
data

    id       name  price       city
0  101     Orange    120     meerut
1  102      Apple    150     Jhansi
2  103      Mango    160     mumbai
3  104     Banana    180    calicut
4  105  pineapple    190  Ghaziabad

In [50]:
data.loc[2]

id          103
name      Mango
price       160
city     mumbai
Name: 2, dtype: object

In [62]:
# data.loc[:] # All element
# data.loc[1:3]
# data.loc[1:3,['name','price']]

## Boolean Indexing
Boolean means a binary variable that can represent either of two states:<br>
**True(indicated by 1)**:<br>
**False (indicated by 0)**<br>
In booelan indexing we can select the subset of data based on actual values in the DataFrame rather than
thier rows/columns label.Thus we can use conditions on column names to filter data values.

In [81]:
data

    id       name  price       city
0  101     Orange    120     meerut
1  102      Apple    150     Jhansi
2  103      Mango    160     mumbai
3  104     Banana    180    calicut
4  105  pineapple    190  Ghaziabad

In [99]:
data.loc[:,'price'] >150

0    False
1    False
2     True
3     True
4     True
Name: price, dtype: bool

## Accessing Data Element Using Slicing

In [107]:
# data.loc[1:3,'name' :'city']
data.loc[1:3,['name','price']]

     name  price
1   Apple    150
2   Mango    160
3  Banana    180

In [108]:
## Filtering rows in DataFrame

In [110]:
data.head()

    id       name  price    city
0  101     Orange    120  meerut
1  102      Apple    150  meerut
2  103      Mango    160  meerut
3  104     Banana    180  meerut
4  105  pineapple    190  meerut

In [123]:
# data.loc[[True,False,False,False,True]]
# data.loc[:,'price'] > 150
# data[data.loc[:,'price'] >150]

## Attributes of DataFrame

In [124]:
data.index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [125]:
data.columns

Index(['id', 'name', 'price', 'city'], dtype='object')

In [126]:
data.values

array([[101, 'Orange', 120, 'meerut'],
       [102, 'Apple', 150, 'meerut'],
       [103, 'Mango', 160, 'meerut'],
       [104, 'Banana', 180, 'meerut'],
       [105, 'pineapple', 190, 'meerut']], dtype=object)

In [127]:
data.shape

(5, 4)

In [128]:
data.size

20

In [129]:
data.T

            0       1       2       3          4
id        101     102     103     104        105
name   Orange   Apple   Mango  Banana  pineapple
price     120     150     160     180        190
city   meerut  meerut  meerut  meerut     meerut

In [130]:
data.head()

    id       name  price    city
0  101     Orange    120  meerut
1  102      Apple    150  meerut
2  103      Mango    160  meerut
3  104     Banana    180  meerut
4  105  pineapple    190  meerut

In [131]:
data.tail()

    id       name  price    city
0  101     Orange    120  meerut
1  102      Apple    150  meerut
2  103      Mango    160  meerut
3  104     Banana    180  meerut
4  105  pineapple    190  meerut